name: "embedding_model"
platform: "onnxruntime_onnx"
max_batch_size: 128

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [ 3, 224, 224 ]
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [ 768 ]
  }
]

instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]

dynamic_batching {
  max_queue_delay_microseconds: 5000
}

optimization {
  graph: {
    level: 1
  }
}
