name: "unit_ensemble"
platform: "ensemble"

input [
  {
    name: "images"
    data_type: TYPE_FP32
    dims: [1, 3, 960, 960]
  },
  {
    name: "params"
    data_type: TYPE_STRING
    dims: [1]
  }
]

output [
  {
    name: "boxes"
    data_type: TYPE_FP32
    dims: [1, -1, 6]
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "unit_onnx"
      model_version: -1
      input_map {
        key: "images"
        value: "images"
      }
      output_map {
        key: "output0"
        value: "raw_output"
      }
    },
    {
      model_name: "unit_postprocess"
      model_version: -1
      input_map {
        key: "raw_output"
        value: "raw_output"
      }
      input_map {
        key: "params"
        value: "params"
      }
      output_map {
        key: "boxes"
        value: "boxes"
      }
    }
  ]
}